{
  "bibliography": [
    {
      "title": "Fibonacci's Rabbits",
      "author": "Adam Hart-Davis",
      "dateFinished": "2020-08-02",
      "synopsis": "The history and details of 50 of the most important discoveries in mathematics.",
      "review": "A wonderful tour of mathematics' most important concepts, and the history of their discovery. I am not generally a \"re-reader\" of books, but I suspect I will be reading this again."
    },
    {
      "title": "Clean Code",
      "author": "Robert C. Martin",
      "dateFinished": "2020-07-04",
      "synopsis": "A discussion of what good software craftsmanship really is and how to get there.",
      "review": "You don't have to agree with every bit of advice. The value comes from gaining an appreciation for carefully considering how our code can be better. A must read, for any software developer that cares about the quality of their work. I suspect the quality of my code has taken a leap simply for having read it."
    },
    {
      "title": "Scrum: The Art of Doing Twice the Work in Half the Time",
      "author": "Jeff Sutherland",
      "dateFinished": "2020-06-13",
      "synopsis": "A collection of anecdotes that explain and justify why Scrum was created.",
      "review": "The books goes into some of the research that explains the effectiveness of agile practices, but predominantly it focuses on sports, military, and business anecdotes. If you're already sold on agile work practices, you're unlikely to gain much from reading this. If you need convincing though, I suspect this book would do the job."
    },
    {
      "title": "Stop Starting, Start Finishing",
      "author": "Arne Roock",
      "dateFinished": "2020-06-07",
      "synopsis": "A super concise high level summary of the key concepts of Kanban.",
      "review": "I like books that get to the point and don't spend too much time waffling, but this is perhaps a little too concise. It doesn't contain enough information for you to start implementing it at your place of work."
    },
    {
      "title": "How To Invent Everything",
      "author": "Ryan North",
      "dateFinished": "2020-05-09",
      "synopsis": "A guide to reinventing civilization from scratch if you happen to be a time traveller stranded in the past.",
      "review": "This is such a fantastic book. I recommend it to everyone, especially stranded time travellers. It's very interesting considering the most important inventions in civilization, especially as you're unlikely to have thought of many of them."
    },
    {
      "title": "Statistics Without Tears: An Introduction for Non-Mathematicians",
      "author": "Derek Rowntree",
      "dateFinished": "2020-03-21",
      "synopsis": "A concise introduction to statistics covering all the basics. Statistics Without Tears avoids focusing on mathematical formula and instead uses good descriptions and examples to impress an intuitive understanding of each concept.",
      "review": "I've encountered almost all the concepts in this book through my professional and academic career, but until reading this I didn't have a good intuitive understanding of what they really meant. A good read."
    },
    {
      "title": "Mythos",
      "author": "Stephen Fry",
      "dateFinished": "2020-03-11",
      "synopsis": "Mythos tells of the origins and escapades of the Greek Gods and some of their descendants with a little embellishment here and there, as well as smattering of the history of their stories.",
      "review": "Mythos was a wonderful detour from my usual genre of reading. Stephen Fry tells the stories wonderfully while throwing in tid-bits about how the names of various Gods etc relate to modern words. A very enjoyable read."
    },
    {
      "title": "Lifespan: Why We Age - and Why We Don't Have To",
      "author": "David A. Sinclair",
      "dateFinished": "2020-01-21",
      "synopsis": "A tour of the research into longevity by someone deep in the field of aging. David Sinclair presents an optimistic view of where the research is headed and talks about what that might mean for our future.",
      "review": "I enjoyed the book thoroughly and feel more optimistic now about treating human aging. One thing I will say however is that David Sinclair is not a skeptic. He is very quick to interpret significance to very early research."
    },
    {
      "title": "The Body: A Guide For Occupants",
      "author": "Bill Bryson",
      "dateFinished": "2019-12-31",
      "synopsis": "Bill Bryson takes us on a tour of the human body. He discusses what we know about each area, as well as how we know it.",
      "review": "I have a medical background myself, with a strong focus on human anatomy. So there were very few surprises when it came to what's where and how it works. I did however derive great enjoyment from hearing about how we discovered everything we know, down to the personal histories of the inventors and discovers in question."
    },
    {
      "title": "Enlightenment Now",
      "author": "Steven Pinker",
      "dateFinished": "2019-11-29",
      "synopsis": "Why the enlightenment was so important, and why everything is much better than the news tends to mention.",
      "review": "A truly uplifting read. Pinker talks us through the data and the world is more peaceful, healthy, happy, and prosperous than it has ever been. There are still problems and occasional bumps in the road, but generally things are pretty rosy. Don't believe it? Read the book."
    },
    {
      "title": "Why Buddhism is True",
      "author": "Robert Wright",
      "dateFinished": "2019-11-19",
      "synopsis": "A scientific justification of the claims of westernized secular Buddhism, looked at through the lenses of neurophysiology and evolutionary psychology.",
      "review": "The book gets a little weird in places where there are detours into ancient Buddhist texts, but that's because ancient texts tend to be a little bit weird. Over-all it is a good summary of the base concepts underlying Buddhism, as well as some of the more common meditative practices."
    },
    {
      "title": "The Lady of the Lake",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-11-07",
      "synopsis": "The 5th and final book in the The Witcher Saga focusing on the adventures of Geralt of Rivia and Princess Ciri.",
      "review": "The Witcher books are a stark, depressing, and realistic take on the traditional fairy-tale and fantasy adventure tropes. Don't expect a perfect ending with all the loose ends tied off, because that's not how life works."
    },
    {
      "title": "Thinking About It Only Makes It Worse",
      "author": "David Mitchell",
      "dateFinished": "2019-10-29",
      "synopsis": "A collection of David Mitchell's articles for various papers and so on.",
      "review": "I very much enjoy David Mitchell's angry sarcastic humour, but I didn't enjoy this nearly as much as I expected to. I don't really know what I was expecting. It was funny, but I was hoping to learn something. I was probably barking up the wrong tree on that one."
    },
    {
      "title": "The Tower of the Swallow",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-10-11",
      "synopsis": "The 4th book in the The Witcher Saga focusing on the adventures of Geralt of Rivia and Princess Ciri.",
      "review": "The Witcher books are a stark, depressing, and realistic take on the traditional fairy-tale and fantasy adventure tropes. You can really feel the tension building in this one. It left me eager to read the next."
    },
    {
      "title": "Baptism of Fire",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-10-04",
      "synopsis": "The 3rd book in the The Witcher Saga focusing on the adventures of Geralt of Rivia and Princess Ciri.",
      "review": "The Witcher books are a stark, depressing, and realistic take on the traditional fairy-tale and fantasy adventure tropes. A phenomenal, raw, and brutal story. Sapkowski's writing style differs at a moment's notice."
    },
    {
      "title": "The Communist Manifesto",
      "author": "Karl Marx & Friedrich Engels",
      "dateFinished": "2019-09-27",
      "synopsis": "The Communist Manifesto standardized what the world thought of as Communism, and sparked revolutions whose effects are felt all over the world till this day.",
      "review": "It's 60 pages long, and frankly it is an important historical document. You should read it. Most people's definitions of communism is incoherent at best and it is good to know what Marx thought it meant, which-ever side of the political divide you happen to find yourself on. That said, Marx was not a clear or concise writer and so it might be difficult to work out precisely what he thought."
    },
    {
      "title": "Time of Contempt",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-09-14",
      "synopsis": "The 2rd book in the The Witcher Saga focusing on the adventures of Geralt of Rivia and Princess Ciri.",
      "review": "The Witcher books are a stark, depressing, and realistic take on the traditional fairy-tale and fantasy adventure tropes. The story kicks up a gear in this book, but there are no satisfying conclusions and you have to pick up the next book immediately to find out what happens."
    },
    {
      "title": "Blood of Elves",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-09-06",
      "synopsis": "The start of The Witcher Saga focusing on the adventures of Geralt of Rivia and Princess Ciri.",
      "review": "The Witcher books are a stark, depressing, and realistic take on the traditional fairy-tale and fantasy adventure tropes. Enjoyable as usual. Although it sometimes feel like something has been lost between it's translation and the original Polish."
    },
    {
      "title": "End This Depression Now",
      "author": "Paul Krugman",
      "dateFinished": "2019-08-26",
      "synopsis": "Nobel prize winning economist Paul Krugman sets out what ought to have been done to put an end to the global economic depression that started in 2010.",
      "review": "Clear and articulate for such a complicated subject. The book focuses on what the US did to try and pull through, but has occasional special mentions for the UK (because of how ridiculous our ultimate strategy was). An important and enlightening read."
    },
    {
      "title": "Sword of Destiny",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-08-12",
      "synopsis": "A series of short stories in a stark, depressing, and realistic fairy-tale world, focusing on the adventures of the Witcher Geralt of Rivia.",
      "review": "The Witcher short stories are very refreshing and different in the fantasy adventure scene. This book convinced me to pick up the five book saga that follows."
    },
    {
      "title": "Basic Economics",
      "author": "Thomas Sowell",
      "dateFinished": "2019-08-07",
      "synopsis": "\"A Common Sense Guide to the Economy\". Thomas Sowell cover all the basic concepts of economics without relying on mathematic formula. He uses descriptions and examples to explain.",
      "review": "I am glad I read Basic Economics. I definitely learned a great deal. I do however have a few complaints. Thomas Sowell is very extremely libertarian, and he's quite pushy about it throughout the book. I would also describe his work as extremely reductionist. I'll just leave it at that."
    },
    {
      "title": "The Last Wish",
      "author": "Andrej Sapkowski",
      "dateFinished": "2019-07-29",
      "synopsis": "A series of short stories in a stark, depressing, and realistic fairy-tale world, focusing on the adventures of the Witcher Geralt of Rivia.",
      "review": "The first fantasy adventure work I have read in a long time, and I sped through it in only three days. I enjoyed it very much. It is an interesting take on the genre."
    },
    {
      "title": "The Man in the High Castle",
      "author": "Philip K. Dick",
      "dateFinished": "2019-07-18",
      "synopsis": "The Man in the High Castle follows the lives of a few loosely associated characters in Japanese occupied California in a world where the Allies lost World War 2.",
      "review": "A very interesting read, and typical of Dick's work. A few of the characters loose their grip on reality in typical Philip K. Dick style, and I was left so confused by the conclusion that I had to sit there for about 10 minutes just to think about what it meant."
    },
    {
      "title": "Expedition to Earth",
      "author": "Arthur C. Clark",
      "dateFinished": "2019-07-16",
      "synopsis": "A collection of short science fiction stories by the legendary Arthur C. Clark, including the story that gives the book its title.",
      "review": "A varied and engaging collection of assorted stories. Some are low fiction near future stories about in-solar system colonization, and others cover distant times and places with unrecognisable alien civilizations. One or two of them might have made good full length books."
    },
    {
      "title": "A Little History of Philosophy",
      "author": "Nigel Warburton",
      "dateFinished": "2019-07-11",
      "synopsis": "A relatively terse compendium of summaries for the historically big ideas in philosophy.",
      "review": "A varied and engaging collection of assorted stories. Some are low fiction near future stories about in-solar system colonization, and others cover distant times and places with unrecognisable alien civilizations. One or two of them might have made good full length books."
    },
    {
      "title": "Waking Up",
      "author": "Sam Harris",
      "dateFinished": "2019-06-02",
      "synopsis": "A modern guide to spirituality without religion, with all the rigor of modern scientific and philosophical thinking.",
      "review": "I enjoy most Sam Harris's work. I find him an incredibly clear thinker. He has a way of reducing discussions to their fundamentals that makes it easy to follow and appreciate. Waking Up is no exception, and presents an intriguing look into the nature of self, free will, volition, and the rest."
    },
    {
      "title": "Thinking Fast and Slow",
      "author": "Daniel Kahneman",
      "dateFinished": "2019-05-24",
      "synopsis": "The ground-breaking work of Nobel Prize winner Daniel Kahneman on the nature of the way that we think and the prospect theory of economics.",
      "review": "If you're unfamiliar with the study of human fallibility, I think this book might be life changing. Even with a keen interest in the subject myself I found the particular of his work on prospect theory and the nature of how we think fascinating. It's a long read, but I highly recommend it."
    },
    {
      "title": "Design Patterns",
      "author": "Gamma, Helm, Johnson, and Vlissides",
      "dateFinished": "2019-02-15",
      "synopsis": "Design Patterns is a classic in the software development world that popularized the term \"design patterns\" and first described some of the standard patterns.",
      "review": "Design Patterns is easy to read, although the examples are all written in C (not my preferred choice). It is a little dry, but I've not seen the classic pattern described so simply and elegantly as in the examples set out in the book. If you're unfamiliar with design patterns, this is definitely a good start."
    },
    {
      "title": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "dateFinished": "2018-12-10",
      "synopsis": "An outline of the history covering all our most significant discoveries, inventions, and political movements.",
      "review": "Sapiens is as wonderful as it is popular (and it is popular). The subject matter is broad and interesting, and I particularly enjoyed the sections on the history of our systems of economics. This book enthused me to do a bit more reading in that sphere. I disagree with Harari on a couple of points in the book, but enjoyed it very much never the less."
    },
    {
      "title": "The Selfish Gene",
      "author": "Richard Dawkins",
      "dateFinished": "2018-08-25",
      "synopsis": "An exceptional and illuminating work on taking a gene's eye view of evolution and the implications of seeing it this way.",
      "review": "The Selfish Gene is a great read. It is also the book the coined the term \"meme\" in a section about non-genetic replicators. This book will make you think. Unless you're already knee deep in genetics, it will probably make you think differently about heredity."
    },
    {
      "title": "Superintelligence: Paths, Dangers, Strategies",
      "author": "Nick Bostrom",
      "dateFinished": "2018-07-15",
      "synopsis": "A book focusing on the dangerous that the author believes we will face as we pave the way towards general artificial intelligence.",
      "review": "Superintelligence was a New York times best seller. Gods know why. It is dense science fiction passed off as genuine concerns. Bostrom has a coherent argument for why he believes AI will destroy or enslave us. But they mostly boil down to empty probabilisms, dodgy generalizations of Moore's law, and a faulty understanding of generality in intelligence. Bostrom completely ignores priors."
    },
    {
      "title": "JavaScript: The Good Parts",
      "author": "Douglas Crockford",
      "dateFinished": "2018-06-19",
      "synopsis": "A short summary of the bits of JavaScript we should stick to and how to use them properly.",
      "review": "The book is humorously short. It concisely goes through the good bits of JavaScript and what every developer should know. I recommend it. It has helped me with a couple of the trickier concepts greatly, and there is much additional wisdom amongst the language feature explanations."
    },
    {
      "title": "Arduino Workshop",
      "author": "John Boxall",
      "dateFinished": "2018-06-03",
      "synopsis": "\"A hands-on introduction with 65 projects\". It guides you through initial Arduino set-up and progressively more complex projects.",
      "review": "I was gifted this with an Arduino starter kit and a box of assorted sensors. This was a brilliant way to start learning Arduino based embedded programming. The book is an up-beat read compared to other technical works. If you're thinking of starting with Arduino, reading this is a good idea."
    },
    {
      "title": "Matter",
      "author": "Iain M. Banks",
      "dateFinished": "2018-04-21",
      "synopsis": "Three very different members of a royal family have to content this politics on the ground, and a variety of higher levels of alien civilizations.",
      "review": "I love Banks's work. This one is wildly complex and thrillingly high paced once it gets started. An interesting combination of fantasy adventure and super futuristic scifi. As with all of Banks's work, I highly recommend it."
    },
    {
      "title": "The Prince",
      "author": "Niccolò Machiavelli",
      "dateFinished": "2018-02-11",
      "synopsis": "A vintage how-to guide to medieval politics. Who to appease, murder, plunder, etc.",
      "review": "It's very short and I enjoyed it a great deal. One thing I will say however is that you will commonly hear it said that this book is useful for modern corporate life. It definitely, definitely isn't."
    },
    {
      "title": "The Pragmatic Programmer",
      "author": "Andrew Hunt and David Thomas",
      "dateFinished": "2017-12-28",
      "synopsis": "The authors offer the best advice they have available to others in their field on how to be good at what we do.",
      "review": "There is a smattering of advice that I would consider out-dated, but the vast majority of it is good advice to this day and probably for a long time. Master your tools, learn your hotkeys, write code to write code, configuration over hard-coding, and much more useful advice."
    },
    {
      "title": "50 philosophy of science ideas you really need to know",
      "author": "Gareth Southwell",
      "dateFinished": "2017-12-17",
      "synopsis": "Does what it says on the tin. A brief summary of 50 important ideas in and around epistemology.",
      "review": "A fun read, and although it won't give you an in-depth understanding of each idea and its nuances, it will allow you to keep up in conversations with epistemology buffs at parties."
    },
    {
      "title": "The Design of Everyday Things",
      "author": "Donald A. Norman",
      "dateFinished": "2017-11-26",
      "synopsis": "How to think about usability in design, with wonderful examples across domains.",
      "review": "This book is essential reading from a giant of the field of usability. The book is significantly less dry than you might imagine, and Norman really loves to complain about doors. Now I do too."
    },
    {
      "title": "Utopia for Realists",
      "author": "Rutger Bregman",
      "dateFinished": "2017-11-19",
      "synopsis": "A few radical sounding ideas for improving society, all of which might not be as far fetched as they seem.",
      "review": "I very much enjoyed this book, and it has changed the way I think about what society could be. In particular Bregmen is known for his advocacy of basic universal income, and he is very convincing. It is absolutely worth a read."
    },
    {
      "title": "XSLT Quickly",
      "author": "Bob DuCharme",
      "dateFinished": "2017-11-13",
      "synopsis": "A concise user guide to using XSLT.",
      "review": "XSLT Quickly got me up to speed in only a few days. I was already using XSLT from time to time professionally, but this book took me from bumbling through to really knowing what I was doing."
    },
    {
      "title": "Do Androids Dream of Electric Sheep?",
      "author": "Philip K. Dick",
      "dateFinished": "2017-08-06",
      "synopsis": "A bounty hunter needs to catch enough escaped androids so that he can buy a real animal.",
      "review": "The book bears a passing resemblance to the Bladerunner movie, but it is much more. Psychedelic, strange, and mind-bending. It features a crazy new religion, and an unusual fascination with keeping real animals. Fun, interesting, and strange."
    },
    {
      "title": "The Moral Landscape: How Science Can Determine Human Values",
      "author": "Sam Harris",
      "dateFinished": "2017-07-31",
      "synopsis": "Sam Harris convincingly argues for a science based pseudo-utilitarian view on morality.",
      "review": "I've always been a philosophical utilitarian. Utilitarianism has always made sense to me. So there is definitely a degree of confirmation bias contributing to my enjoyment of this book. That said, Sam gives this debate much more clarity and nuance than you will usually find,"
    },
    {
      "title": "The Voyage of a Naturalist",
      "author": "Charles Darwin",
      "dateFinished": "2017-06-26",
      "synopsis": "The journal of Charles Darwin on his voyage on the HMS Beagle.",
      "review": "Darwin didn't write his journal with the goal of writing a breath-taking adventure story, so there are whole chapters dedicated to the appearance of crustaceans and rock formations. That said, his journey was very definitely an adventure and Darwin is a good and clear writer. His journal was a joy to read, and even occasionally thrilling."
    },
    {
      "title": "Changing Faces",
      "author": "James Partridge",
      "dateFinished": "2017-06-14",
      "synopsis": "A semi-autobiographical work about what it is like to live with facial disfigurement.",
      "review": "Changing Faces isn't a light hearted read. It can be difficult to step into the shoes of someone who has gone through something quite as traumatic as significant facial injuries. Being forced to empathise in this way is good for the soul."
    },
    {
      "title": "Stranger in a Strange Land",
      "author": "Robert A. Heinlein",
      "dateFinished": "2017-05-29",
      "synopsis": "A human child raised by a mysterious Martian species returns to Earth, and causes a scene.",
      "review": "People claim that this book heavily shaped popular culture in the 60s, and it's easy to see why. A psychic human child reared by incomprehensible Martians becomes a cult leader and preaches selflessness, free love, communes, etc. A very different read to what I was expecting. It was good."
    },
    {
      "title": "Spring Boot in Action",
      "author": "Craig Walls",
      "dateFinished": "2017-05-12",
      "synopsis": "A guide to the features of Spring Boot.",
      "review": "I had already been using Spring Boot for a number of projects both professionally and as a hobby and was hoping to learn a thing or two. I did learn plenty, especially about the pre-configured starter dependencies, but I guess I was expecting a bit more."
    },
    {
      "title": "The Complete Robot",
      "author": "Isaac Asimov",
      "dateFinished": "2017-04-17",
      "synopsis": "A compilation of robot related short stories by Isaac Asimov.",
      "review": "All of Asimov's stories are great. It's also incredibly interesting reading his vision of the future, in particular what he didn't see coming. This collection includes a few of the classics, for example the bicentennial man. A great read."
    },
    {
      "title": "The Lean Startup",
      "author": "Eric Ries",
      "dateFinished": "2017-04-08",
      "synopsis": "An instruction manual for running a business in an uncertain market using a cyclic scientific method.",
      "review": "I've not really been involved much with the startup culture, but this books gets you up to speed with a lot of the better ideas in the scene. Well written, interesting, and useful. Would recommend."
    },
    {
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "dateFinished": "2017-03-06",
      "synopsis": "A series of dramas in love and a misunderstanding in early 19th century England.",
      "review": "This is my wife's favourite book, and so I had to read it eventually. I enjoyed it much more than I am willing to admit. In addition to enjoying it greatly, Austen's work is an important part of the history of literature as well as women's rights."
    },
    {
      "title": "Driverless",
      "author": "Hod Lipson and Melba Kurman",
      "dateFinished": "2017-02-18",
      "synopsis": "The history, current state, and future predictions for driverless car technology.",
      "review": "Speculative, but very interesting. They make few bets on when fully autonomous vehicles will be on the road, but make some interesting predictions for when they do. Cars as a service, fewer car parks, and a complete reshaping of the automotive industry as we know it."
    },
    {
      "title": "Feersum Endjinn",
      "author": "Iain M. Banks",
      "dateFinished": "2017-02-04",
      "synopsis": "Political intrigue, simulated dream-like afterlives, lived out in an unknowably large mega-structure.",
      "review": "Confusing, mysterious, fast paced, and dream like. A disorienting roller coaster of a story. Iain M. Banks writes a wonderful story. There's not much more to say except read all his books."
    },
    {
      "title": "Free Will",
      "author": "Sam Harris",
      "dateFinished": "2016-12-27",
      "synopsis": "What is \"free will\" anyway? Does it even make any sense?.",
      "review": "A clear and concise argument for why \"free will\", or what people typically consider that to be, is a kind of myth left over from dualism. The book is only 70 pages long and gets right to the heart of the argument quickly. It even finds time to consider some of the traditional counter-arguments. You should read it. It is very short, easy to read, and likely to change the way you look at the world."
    },
    {
      "title": "Homo Deus",
      "author": "Yuval Noah Harari",
      "dateFinished": "2016-12-21",
      "synopsis": "A short catch-up on how far humankind has come, and a speculative explorations of where we might end up.",
      "review": "Harari makes interesting predictions for where humankind is headed, with an emphasis on ideology and technology. More than the predictions, I particularly enjoyed the historical recap, covering ideologies as well a political and economic systems,"
    },
    {
      "title": "Inversions",
      "author": "Iain M. Banks",
      "dateFinished": "2016-10-30",
      "synopsis": "Two mysteriously capable advisors to competing rulers are more than they seem.",
      "review": "Political intrigue and machiavellian plots. Smart, funny, tense, with believable and relatable characters. If I were to recommend this one, I would recommend you read other books in the Iain M. Banks culture series first. I feel I enjoyed this more because I was able to speculate about who the main characters really were."
    },
    {
      "title": "The Magic of Reality",
      "author": "Richard Dawkins",
      "dateFinished": "2016-10-26",
      "synopsis": "An elegant introduction to the questions inquisitive young minds ask.",
      "review": "I'm not sure I would recommend this one to the type of people who are looking for book recommendations. The content is a little too simple. That said, if you have a young child or relation who is asking these kinds of questions it might be good to read, just so questions like \"why is the sky blue?\" don't trip you up."
    },
    {
      "title": "God is Not Great",
      "author": "Christopher Hitchens",
      "dateFinished": "2016-09-27",
      "synopsis": "Christopher Hitchens makes the case against organized religion.",
      "review": "If Richard Dawkins's The God Delusion is a cool, rational, and scientific argument against the existence of God, this work is an angry and impassioned stand against the evils of organized religion. Hitchens has a wicked sharp wit and wields his angry and powerful arguments like a precision weapon."
    },
    {
      "title": "The Trouble With Physics",
      "author": "Lee Smolin",
      "dateFinished": "2016-09-21",
      "synopsis": "A layman's explanation of where physics is at, our struggle with unifying physics, and why string theory is bad.",
      "review": "Smolin lays into string theory and complains about the way academic science is organised. From what little I know about both areas, I am fully with him. String theory reeks of pre-Copernican models of the world. More than anything, it was interesting reading about internal conflicts in academic physics and the kinds of things physicists probably gossip about."
    },
    {
      "title": "Excession",
      "author": "Iain M. Banks",
      "dateFinished": "2016-08-19",
      "synopsis": "A super futuristic society find an object that transcends all their understanding of what is possible.",
      "review": "Every Banks book is a classic. If you're a fan of the super-intelligent AIs from the other books you'll love this one. A lot of the dialog occurs between them, trying to work what ought to be done, and whether to approach this paradigm shattering object."
    },
    {
      "title": "Elements of Computer Systems",
      "author": "Noam Nisan and Shimon Schocken",
      "dateFinished": "2016-08-06",
      "synopsis": "Building a modern computer from first principles.",
      "review": "Strictly speaking this is a text book, for a course commonly called \"From Nand to Tetris\", but it is a much more pleasant read than most. If you want to know how to literally build a computer from nothing, and then simulate doing just that, then this book will talk you through it. I didn't think that knowledge could be available so precisely. This book is a modern marvel. I love it."
    },
    {
      "title": "Look to Windward",
      "author": "Iain M. Banks",
      "dateFinished": "2016-07-17",
      "synopsis": "A terrorist plot, a bigger political feud, and every-day life on an orbital class spacecraft.",
      "review": "Look to Windward is a more quiet and thoughtful piece than most of the other Culture series books. As a long time follower of the Culture series books it is nice to see more regular citizens and environments. A relaxing and satisfying read."
    },
    {
      "title": "Seven Brief Lessons on Physics",
      "author": "Carlo Rovelli",
      "dateFinished": "2016-06-26",
      "synopsis": "It does what it says on the tin. Seven brief lessons in physics.",
      "review": "This book is as much a work of poetry as it is a work of physics. Beautiful and elegant prose."
    },
    {
      "title": "Elon Musk",
      "author": "Ashlee Vance",
      "dateFinished": "2016-06-25",
      "synopsis": "A more-or-less-authorised biography of Elon Musk.",
      "review": "Most entrepreneurs are enormously lucky, but Ashley Vance paints a quite different picture for Elon Musk. Even with survivor bias it is difficult to imagine someone being this reliably lucky with industries that don't rely on catching a trend or new discovery. The anecdotal study of the very successful is fascinating at the best of times, and Elon Musk is a special case."
    },
    {
      "title": "Pro Git",
      "author": "Scott Chacon and Ben Straub",
      "dateFinished": "2016-06-12",
      "synopsis": "\"Everything you need to know about Git\"",
      "review": "With Git, many just learn the basics and then search online to solve problems later. Reading this has resulted in my being known as the \"Pro Git\" around the office. I will occasionally hear the phrase \"sounds like you might need to ask the Pro Git\" from the other side of the office, and know to expect a visit shortly. A very worth-while read. And it's free online."
    },
    {
      "title": "Becoming a Better Programmer",
      "author": "Pete Goodliffe",
      "dateFinished": "2016-05-15",
      "synopsis": "Tip and advice for people who care about being the best programmer they can be.",
      "review": "Light hearted and easy to read. It covers the basics for a lot of reasonably modern industry best practices, which is a life-saver for anyone starting out in the trade. I would recommend it all new programmers."
    },
    {
      "title": "Java EE 7 Essentials",
      "author": "Arun Gupta",
      "dateFinished": "2015-10-25",
      "synopsis": "A run down on some of the new features in Java EE 7.",
      "review": "This turns out to not have been so relevant to my working life. Additionally, Arun Gupta's writing style is really really dry. Lots of useful information, but it was difficult to keep motivated enough to finish it."
    },
    {
      "title": "The Intelligent Web",
      "author": "Gautam Shroff",
      "dateFinished": "2015-10-01",
      "synopsis": "A journey through the computer science of search, natural language, text mining, machine learning, swarm computing, and semantic reasoning.",
      "review": "I really enjoyed this read. Schroff takes us on a tour of a lot of the technologies that make up modern intelligent software, with just enough details to give you a little insight into each."
    }
  ]
}
